#### 5. Create a DataFrame of products with columns: Product Name, Price, Category.
 Add a new column - Discounted Price = 90% of Price.
 Filter and show products cheaper than 500.

In [2]:
import pandas as pd

In [11]:
data = {
    "Product Name": ["Laptop", "Headphones", "Keyboard", "Mouse", "Monitor","Earphones"],
    "Price": [68999, 3700, 1499, 399, 7999,149],
    "Category": ["Electronics", "Accessories", "Accessories", "Accessories", "Electronics", "Accessories"]
}

df = pd.DataFrame(data)

In [12]:
df

  Product Name  Price     Category
0       Laptop  68999  Electronics
1   Headphones   3700  Accessories
2     Keyboard   1499  Accessories
3        Mouse    399  Accessories
4      Monitor   7999  Electronics
5    Earphones    149  Accessories

In [13]:
df["Discounted Price"] = df["Price"] * 0.9

In [14]:
df

  Product Name  Price     Category  Discounted Price
0       Laptop  68999  Electronics           62099.1
1   Headphones   3700  Accessories            3330.0
2     Keyboard   1499  Accessories            1349.1
3        Mouse    399  Accessories             359.1
4      Monitor   7999  Electronics            7199.1
5    Earphones    149  Accessories             134.1

In [15]:
cheap_products = df[df["Price"] < 500]

In [17]:
print("Cheap product which are less than 500\n", cheap_products)

Cheap product which are less than 500
   Product Name  Price     Category  Discounted Price
3        Mouse    399  Accessories             359.1
5    Earphones    149  Accessories             134.1